{"inkVersion":21,"root":[["\n","^I slam into the ship’s outer airlock, gripping the handle like a lifeline. The hatch cycles open, and I stumble inside. I rip off my helmet, gasping for air.","\n","^“Made it… barely.”","\n","ev","str","^Check others' signals on the console.","/str","/ev",{"*":"0.c-0","flg":20},{"c-0":["^ ",{"->":"check_signals"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"check_signals":[["^I stagger to the console and pull up the life tracker display. My hands tremble as the markers for Grady, Singh, and Juno appear—each surrounded by a faint red glow.","\n","^“No. No… this can’t be right.”","\n","^I tap through the data. The readings confirm it: no vital signs, no chance of recovery. My stomach sinks, and my throat tightens.","\n","^I slam my fist against the console, taking a moment to steady my breathing. The wreckage of the alien warship still hangs in the distance, a cold reminder of what went wrong.","\n","^I glance at the control room door—it’s jammed shut.","\n","^“Alright. No time to mourn. They wouldn’t want me to die here, too.”","\n","ev","str","^Check the system diagnostics on the console.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"check_system"},{"#f":5}]}],{"#f":1}],"check_system":["^The system diagnostics tell me what I need to know.","\n","^To pilot the ship, I’ll need three things: a Hull laser to cut into the jammed control room door, the Captain’s ID card to start the system, and a Sealant to patch the open door.","\n","ev",true,"/ev",{"VAR=":"task_received","re":true},"^Each item is logged to a different crew member. Grady had the laser. Juno carried the sealant. Singh had the ID card. Their markers are… scattered.","\n","^The display zooms out, showing the locations of their bodies—each drifting on nearby asteroids, scattered from the blast. I swallow hard, my voice quiet.","\n","^“Alright. One thing at a time. Get the tools, seal the door, get out of here. You can do this.”","\n","^I pull the helmet back on, the hiss of the suit breaks the silence as I step back into space. The HUD highlights the markers.","\n","done",{"#f":1}],"global decl":["ev",false,{"VAR=":"task_received"},false,{"VAR=":"laser_acquired"},false,{"VAR=":"sealant_acquired"},false,{"VAR=":"id_card_acquired"},false,{"VAR=":"all_acquired"},"/ev","end",null],"#f":1}],"listDefs":{}}