{"inkVersion":21,"root":[["\n","ev",true,"/ev",{"VAR=":"laser_acquired","re":true},"^I drift toward the marker, the asteroid growing larger as the HUD guides me in. My thrusters fire one last burst, and I land softly, anchoring myself on the rough surface.","\n","^Grady’s body lies just ahead, sprawled across a jagged rock. His suit is scorched, the visor cracked, but his tool belt is intact. The Hull laser is clipped there, still pristine.","\n","ev","str","^Get the Hull laser.","/str","/ev",{"*":"0.c-0","flg":20},{"c-0":["^ ",{"->":"get_laser"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"get_laser":[["^I kneel beside him, carefully unclipping the Hull laser from his tool belt. It’s still intact, untouched by the blast. My fingers hover for a moment as memories flood back.","\n","^He’d come up to us in a bar, of all places. We were halfway through celebrating a decent haul when this wiry kid, barely old enough to be out here, strode right up to our table. His eyes lit up when he saw our suits.","\n","^“You’re salvagers, right? I can tell—those suits are top-grade. Look, I know what I’m doing, and I’ll work hard. Just give me a shot! You won’t regret it!”","\n","^He was all energy, all confidence. Grady practically dared us to say no. Juno laughed so hard she almost spilled her drink, but Singh leaned back and said, ‘Alright, kid. One run. Prove you’ve got what it takes.’","\n","^And he did. Over and over. Brave, reckless, always first to dive into danger. Always chasing that big fortune he thought was just one haul away.","\n","^“I’ll make us rich,” he said once, after a long day out in the field. “Not just comfortable. Rich. You’ll see.”","\n","^But now, here he is. Brave, energetic Grady, his dreams of fortune ending here on a cold rock in the middle of nowhere.","\n","^“Damn it, kid. You always thought you were invincible. That we were.”","\n","^I grip the Hull laser tightly, securing it to my suit. I glance at Grady’s tank. The sign shows there is still some air left.","\n","ev","str","^Take Grady's air supply.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Leave it as it is.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"take_oxygen"},"\n",{"#f":5}],"c-1":["^ ",{"->":"leave"},"\n",{"#f":5}]}],{"#f":1}],"take_oxygen":["^I hate what I’m about to do, but there’s no other choice. Slowly, carefully, I attach the transfer hose between us and siphon what little air remains in his system.","\n","^“I’m sorry, kid. But I’ll make it count. I’ll carry your dream back with me.”","\n","done",{"#f":1}],"leave":["^My hand hovers over the transfer hose, but I pull it back. Grady wouldn’t have wanted this. He always ran in headfirst, all-in, not holding back for anything. That spirit shouldn’t end like this.","\n","^I shake my head, the tightness in my chest not just from the lack of air. “No, Grady. You ran ahead, like you always do. Let me follow your lead this time.”","\n","done",{"#f":1}],"global decl":["ev",false,{"VAR=":"laser_acquired"},false,{"VAR=":"sealant_acquired"},false,{"VAR=":"id_card_acquired"},false,{"VAR=":"laser_used"},false,{"VAR=":"sealant_used"},false,{"VAR=":"id_card_used"},"/ev","end",null],"#f":1}],"listDefs":{}}