{"inkVersion":21,"root":[["\n","ev",true,"/ev",{"VAR=":"sealant_acquired","re":true},"^The HUD guides me to the marker, an asteroid spinning slowly against the endless void.","\n","^Juno’s suit is easy to spot—a splash of bright color amid the gray rock. I land nearby, my boots kicking up a small puff of dust as I approach. Her tool belt still strapped on.","\n","ev","str","^Look for the Sealant.","/str","/ev",{"*":"0.c-0","flg":20},{"c-0":["^ ",{"->":"get_sealant"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"get_sealant":[["^I crouch beside her, my hand hovering over the belt. The sealant canister gleams under the faint starlight, just where it always is. My fingers pause, and the memories rush in.","\n","^Juno was always so casual about everything. She didn’t join us for money like Grady or for leadership like Singh. No, she joined for fun. She told me that, plain as day, the first time I met her.","\n","^“Why not? It’s something new, something different,” she said with a shrug, tinkering with a busted comm panel. “I’m not into the whole 9-to-5 grind. This gig? It’s perfect. Weird places, weird tech… and I get to blow stuff up sometimes.”","\n","^She was brilliant, though. The number of times she patched up our ship mid-flight or got our gears online just in time? I lost count.","\n","^“What would we do without you, Juno?” I’d ask, half-joking. And she’d smirk, twirling her hydrospanner like a baton.","\n","^“Crash and burn, probably. But hey, I’m here, so don’t sweat it.”","\n","^I shake my head, swallowing hard as I unclip the sealant from her belt. This time, she wasn’t here to save us. She was here because she wanted to be, because the galaxy was one big adventure to her.","\n","^“You weren’t supposed to end up like this, Juno. You wanted to see it all, didn’t you?”","\n","^I secure the sealant to my suit and stand, my chest tightening as I glance at her tank.","\n","ev","str","^Take Juno's air supply.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Leave it as it is.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"take_oxygen"},"\n",{"#f":5}],"c-1":["^ ",{"->":"leave"},"\n",{"#f":5}]}],{"#f":1}],"take_oxygen":["^I curse under my breath, my hands trembling as I hook up the transfer system. The air flows into my tank, precious and life-saving.","\n","^“You always said you were here to keep us alive. Even now, you’re still saving me.”","\n","done",{"#f":1}],"leave":["^My fingers hover over the transfer system, and for a second, I imagine her rolling her eyes at me.","\n","^“What would we do without you, Juno?” I’d asked her so many times. Her answer was always the same—a smirk and a shrug.","\n","^“Crash and burn, probably.”","\n","^But now, it’s different. I shake my head, clenching my fists. “Not this time. You gave us enough already.”","\n","done",{"#f":1}],"global decl":["ev",false,{"VAR=":"task_received"},false,{"VAR=":"laser_acquired"},false,{"VAR=":"sealant_acquired"},false,{"VAR=":"id_card_acquired"},false,{"VAR=":"laser_used"},false,{"VAR=":"sealant_used"},false,{"VAR=":"id_card_used"},"/ev","end",null],"#f":1}],"listDefs":{}}