{"inkVersion":21,"root":[["^I snap awake to the vast emptiness of space.","\n","^My suit hisses—a soft, steady leak. The HUD flashes: Oxygen: 18%. Suit breach detected. My head spins as I twist around.","\n",{"->":"main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":[["^“What… what happened?”","\n","ev","str","^Look around.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"look_around"},"\n",{"#f":5}]}],{"#f":1}],"look_around":[["^[Tutorial: Move the mouse around to change your view.]","\n","^Looking around, behind me, an alien warship looms, with a gaping hole where the airlock used to be. Then it hits me — Grady was cutting through the hatch. He thought it was safe, an airlock we could use. But as soon as we breached it...","\n","^“BOOM. God, the explosion… I blacked out.”","\n","^The thought sends a chill down my spine. My crew—Grady, Singh, Juno—what happened to them? Are they alive? I fumble for the comms.","\n","ev","str","^Try the comms.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"try_comms"},"\n",{"#f":5}]}],{"#f":1}],"try_comms":["^“Grady? Singh? Juno? Can anyone hear me?”","\n","^Nothing but static. I curse under my breath, my eyes locking onto the salvage ship. It hangs far away, impossibly distant. The life trackers are on the ship. I need to get there to check on them, using the precious oxygen to boost.","\n","^[The 3D map in the right of your HUD is a map of your surroundings. The gray bipyramids are meteors, and the small spaceship model indicates the position of your spaceship.]","\n","^[The blue sphere is a symbol of yourself. The blue arrow marks the direction you are facing, and the red arrow marks the direction where your head is pointing.]","\n","^[The oxygen bar is on the top of your HUD. You are consuming the oxygen slowly, and orienting using air thrusters takes extra oxygen. You need to get to the spaceship before running out of oxygen.]","\n","^My chest tightens as I look around. The spaceship glints in the distance. My HUD calculates the trajectory. Boosting directly? It’ll take more oxygen than I have.","\n","^“No tether. Not enough air. Great. Alright… think.”","\n","^I spot a small asteroid floating between me and the ship. If I can land on it and push off, I might get enough momentum without burning too much oxygen.","\n","^“Okay. One step at a time. Get to that rock first.”","\n","^With a shaky hand, I activate the suit’s air thrusters.","\n","^[Tutorial: Press 'WASD' to move around, and press 'Q' and 'E' to spin. You can also press 'Shift' to accelerate and 'Space' to slow down. All of those actions uses oxygen.]","\n","^A quick burst propels me forward. The hiss grows louder.","\n","^“Easy… conserve the oxygen. One burst at a time.”","\n","^[Tutorial: When getting closer to an asteroid with low speed, hold Left Mouse Button to prepare for grounding. You must keep holding Left Mouse Button to remain grounded.]","\n","^With a thud, I land on its surface, gripping a jagged edge to steady myself. I catch my breath, the hissing of my suit relentless.","\n","^“Easy… just a little more.”","\n","^[Tutorial: You can continue to use 'WASD' to move around, and 'QE' to rotate left and right. Move the mouse around more than 90° away to aim.]","\n","^I angle my body, orienting toward the ship.","\n","^“Alright. Now for the hard part.”","\n","^[Tutorial: Hold both Left and Right Mouse Button to gather strength. You can let go of the Left Mouse Button to push off, or let go of the Right Mouse Button to remain grounded.]","\n","^I crouch, coil my arms and legs, and push off with everything I’ve got. The asteroid recedes, the ship growing larger. Every second counts.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}